In [8]:
import pandas as pd
import numpy as np
mydata =[15,20,25]
pddata=pd.DataFrame(mydata)
pddata

    0
0  15
1  20
2  25

In [7]:
newdata=(30,35,40)
newpddata=pd.DataFrame(newdata)
newpddata

    0
0  30
1  35
2  40

In [14]:
impdata={"a":[12,89],"b":[67,14],"c":[34,53]}
imppddata=pd.DataFrame(impdata)

In [15]:
imppddata

    a   b   c
0  12  67  34
1  89  14  53

In [17]:
game = pd.DataFrame([['Rohit','BATSMAN',50],['KOHLI','BATSMAN',80],['BUMRAH','BOWLER',15]],columns=["Name","Type","Score"])
print(game)
print(game['Name'][1])

     Name     Type  Score
0   Rohit  BATSMAN     50
1   KOHLI  BATSMAN     80
2  BUMRAH   BOWLER     15
KOHLI

In [29]:
empdata = np.array([[8000,10000,18000],[15000,20000,25000]])
pdempdata = pd.DataFrame(empdata,columns=[2020,2021,2022])
pdempdata

    2020   2021   2022
0   8000  10000  18000
1  15000  20000  25000

In [30]:
pdempdata = pd.DataFrame(empdata,index=["RAMESH","MAHESH"],columns=[2020,2021,2022])
pdempdata

         2020   2021   2022
RAMESH   8000  10000  18000
MAHESH  15000  20000  25000

In [31]:
pdempdata["TOTAL"] = 12* (pdempdata[2020]+pdempdata[2021]+pdempdata[2022])

In [32]:
pdempdata

         2020   2021   2022   TOTAL
RAMESH   8000  10000  18000  432000
MAHESH  15000  20000  25000  720000

In [33]:
pdempdata[2023]=pdempdata[2022]+(pdempdata[2022]*0.30)
pdempdata

         2020   2021   2022   TOTAL     2023
RAMESH   8000  10000  18000  432000  23400.0
MAHESH  15000  20000  25000  720000  32500.0

In [34]:
pdempdata.to_csv('filename.csv')